// Перша частина домашньої роботи

let age = prompt('Вкажіть Ваш рік народження');
let city = prompt('В якому місті ви живете?');
let sport = prompt('Який Ваш улюблений вид спорту?');

let capital = ['Київ', 'Лондон', 'Париж', 'Вашингтон', 'Прага']

if (city === capital) {
    alert(`${age}. Ти живеш у столиці ${city}`);
} else {
    alert(`${age}. Ти живеш у місті ${city}`);
}


// Друга частина домашньої роботи

/* let age = prompt('Вкажіть Ваш рік народження');
if (age === null) {
    alert('Шкода що Ви не ввели свій рік народження');
}

let user = prompt('Як вас звати?');
if (user === null) {
    alert('Шкода що Ви не ввели своє ім`я');
}

let sport = prompt('Який Ваш улюблений вид спорту?');
if (sport === null) {
    alert('Шкода що Ви не ввели свій улюблений вид спорту');
}

switch (user) {
    case 'Андрій':
    case 'Артур':
    case 'Вітя':
        if (sport === 'бокс' || 'футбол' || 'хокей') {
            alert(`Круто! Хочеш стати чемпіоном ${user}?`)
        };
        break;
    default:
        alert('Маємо надію, що найближчим часом ви станете чемпіоном!');
} */

// Спочатку був нижченаведений варантБ но надто громіздкий. Замість нього зробив із вкладенням що вище.

/* let message = (user === 'Андрій' || 'Артур' || 'Вітя' && sport === 'бокс' || 'футбол' || 'хокей') ? `Хочеш стати чемпіоном ${user}?` : `Ти хороший, ${user}?`;
alert(message); */


